# Create cluster with maintenance window set
```
jamesjungis@jamesjungis:~/terraform-test-dir$ TF_CLI_CONFIG_FILE="/usr/local/google/home/jamesjungis/tf-dev-override.tfrc" terraform plan
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - hashicorp/google in /usr/local/google/home/jamesjungis/go/bin
│  - hashicorp/google-beta in /usr/local/google/home/jamesjungis/go/bin
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible
│ with published releases.
╵

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_edgecontainer_cluster.lcp-cluster will be created
  + resource "google_edgecontainer_cluster" "lcp-cluster" {
      + cluster_ca_certificate                    = (sensitive value)
      + control_plane_version                     = (known after apply)
      + create_time                               = (known after apply)
      + default_max_pods_per_node                 = (known after apply)
      + effective_labels                          = (known after apply)
      + endpoint                                  = (known after apply)
      + external_load_balancer_ipv4_address_pools = [
          + "172.17.7.119-172.17.7.121",
        ]
      + id                                        = (known after apply)
      + location                                  = "us-central1"
      + maintenance_events                        = (known after apply)
      + name                                      = "terraform-lcp-cluster-for-mew"
      + node_version                              = (known after apply)
      + port                                      = (known after apply)
      + project                                   = "gmec-developers-42"
      + release_channel                           = "NONE"
      + status                                    = (known after apply)
      + target_version                            = (known after apply)
      + terraform_labels                          = (known after apply)
      + update_time                               = (known after apply)

      + authorization {
          + admin_users {
              + username = "jamesjungis@google.com"
            }
        }

      + control_plane {
          + local {
              + machine_filter           = "den31-04"
              + node_count               = 1
              + node_location            = "us-central1-edge-den31"
              + shared_deployment_policy = "ALLOWED"
            }
        }

      + fleet {
          + membership = (known after apply)
          + project    = "projects/728138836403"
        }

      + maintenance_policy {
          + window {
              + recurring_window {
                  + recurrence = "FREQ=WEEKLY"

                  + window {
                      + end_time   = "2024-05-27T06:00:00Z"
                      + start_time = "2024-05-27T00:00:00Z"
                    }
                }
            }
        }

      + networking {
          + cluster_ipv4_cidr_blocks  = [
              + "10.0.0.0/16",
            ]
          + network_type              = (known after apply)
          + services_ipv4_cidr_blocks = [
              + "10.1.0.0/16",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform
apply" now.
jamesjungis@jamesjungis:~/terraform-test-dir$ TF_CLI_CONFIG_FILE="/usr/local/google/home/jamesjungis/tf-dev-override.tfrc" terraform apply
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - hashicorp/google in /usr/local/google/home/jamesjungis/go/bin
│  - hashicorp/google-beta in /usr/local/google/home/jamesjungis/go/bin
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible
│ with published releases.
╵

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_edgecontainer_cluster.lcp-cluster will be created
  + resource "google_edgecontainer_cluster" "lcp-cluster" {
      + cluster_ca_certificate                    = (sensitive value)
      + control_plane_version                     = (known after apply)
      + create_time                               = (known after apply)
      + default_max_pods_per_node                 = (known after apply)
      + effective_labels                          = (known after apply)
      + endpoint                                  = (known after apply)
      + external_load_balancer_ipv4_address_pools = [
          + "172.17.7.119-172.17.7.121",
        ]
      + id                                        = (known after apply)
      + location                                  = "us-central1"
      + maintenance_events                        = (known after apply)
      + name                                      = "terraform-lcp-cluster-for-mew"
      + node_version                              = (known after apply)
      + port                                      = (known after apply)
      + project                                   = "gmec-developers-42"
      + release_channel                           = "NONE"
      + status                                    = (known after apply)
      + target_version                            = (known after apply)
      + terraform_labels                          = (known after apply)
      + update_time                               = (known after apply)

      + authorization {
          + admin_users {
              + username = "jamesjungis@google.com"
            }
        }

      + control_plane {
          + local {
              + machine_filter           = "den31-04"
              + node_count               = 1
              + node_location            = "us-central1-edge-den31"
              + shared_deployment_policy = "ALLOWED"
            }
        }

      + fleet {
          + membership = (known after apply)
          + project    = "projects/728138836403"
        }

      + maintenance_policy {
          + window {
              + recurring_window {
                  + recurrence = "FREQ=WEEKLY"

                  + window {
                      + end_time   = "2024-05-27T06:00:00Z"
                      + start_time = "2024-05-27T00:00:00Z"
                    }
                }
            }
        }

      + networking {
          + cluster_ipv4_cidr_blocks  = [
              + "10.0.0.0/16",
            ]
          + network_type              = (known after apply)
          + services_ipv4_cidr_blocks = [
              + "10.1.0.0/16",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_edgecontainer_cluster.lcp-cluster: Creation complete after 34m3s [id=projects/gmec-developers-42/locations/us-central1/clusters/terraform-lcp-cluster-for-mew]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

# check created cluster via gcloud describe 
```
jamesjungis@jamesjungis:/google/src/cloud/jamesjungis/tinker/google3$ gcloud edge-cloud container clusters describe terraform-lcp-cluster-for-mew --location us-central1 --project 728138836403
maintenancePolicy:
  window:
    recurringWindow:
      recurrence: FREQ=WEEKLY
      window:
        endTime: '2024-05-27T06:00:00Z'
        startTime: '2024-05-27T00:00:00Z'
name: projects/728138836403/locations/us-central1/clusters/terraform-lcp-cluster-for-mew
updateTime: '2024-05-28T20:40:26.707806488Z'
```

# Update main.tf so that cluster can be configured with 2 exclusion windows. This tests cluster update via terraform.
```
jamesjungis@jamesjungis:~/terraform-test-dir$ TF_CLI_CONFIG_FILE="/usr/local/google/home/jamesjungis/tf-dev-override.tfrc" terraform plan
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - hashicorp/google in /usr/local/google/home/jamesjungis/go/bin
│  - hashicorp/google-beta in /usr/local/google/home/jamesjungis/go/bin
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible
│ with published releases.
╵
google_edgecontainer_cluster.lcp-cluster: Refreshing state... [id=projects/gmec-developers-42/locations/us-central1/clusters/terraform-lcp-cluster-for-mew]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # google_edgecontainer_cluster.lcp-cluster will be updated in-place
  ~ resource "google_edgecontainer_cluster" "lcp-cluster" {
        id                                        = "projects/gmec-developers-42/locations/us-central1/clusters/terraform-lcp-cluster-for-mew"
        name                                      = "terraform-lcp-cluster-for-mew"
        # (17 unchanged attributes hidden)

      ~ maintenance_policy {
          + maintenance_exclusions {
              + id = "short-exclusion"

              + window {
                  + end_time   = "2024-06-01T12:00:00Z"
                  + start_time = "2024-06-01T00:00:00Z"
                }
            }
          + maintenance_exclusions {
              + id = "long-exclusion"

              + window {
                  + end_time   = "2024-06-10T00:00:00Z"
                  + start_time = "2024-06-03T00:00:00Z"
                }
            }

            # (1 unchanged block hidden)
        }

        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform
apply" now.
jamesjungis@jamesjungis:~/terraform-test-dir$ TF_CLI_CONFIG_FILE="/usr/local/google/home/jamesjungis/tf-dev-override.tfrc" terraform apply
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - hashicorp/google-beta in /usr/local/google/home/jamesjungis/go/bin
│  - hashicorp/google in /usr/local/google/home/jamesjungis/go/bin
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible
│ with published releases.
╵
google_edgecontainer_cluster.lcp-cluster: Refreshing state... [id=projects/gmec-developers-42/locations/us-central1/clusters/terraform-lcp-cluster-for-mew]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # google_edgecontainer_cluster.lcp-cluster will be updated in-place
  ~ resource "google_edgecontainer_cluster" "lcp-cluster" {
        id                                        = "projects/gmec-developers-42/locations/us-central1/clusters/terraform-lcp-cluster-for-mew"
        name                                      = "terraform-lcp-cluster-for-mew"
        # (17 unchanged attributes hidden)

      ~ maintenance_policy {
          + maintenance_exclusions {
              + id = "short-exclusion"

              + window {
                  + end_time   = "2024-06-01T12:00:00Z"
                  + start_time = "2024-06-01T00:00:00Z"
                }
            }
          + maintenance_exclusions {
              + id = "long-exclusion"

              + window {
                  + end_time   = "2024-06-10T00:00:00Z"
                  + start_time = "2024-06-03T00:00:00Z"
                }
            }

            # (1 unchanged block hidden)
        }

        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_edgecontainer_cluster.lcp-cluster: Modifying... [id=projects/gmec-developers-42/locations/us-central1/clusters/terraform-lcp-cluster-for-mew]
google_edgecontainer_cluster.lcp-cluster: Still modifying... [id=projects/gmec-developers-42/locations/u...clusters/terraform-lcp-cluster-for-mew, 10s elapsed]
google_edgecontainer_cluster.lcp-cluster: Still modifying... [id=projects/gmec-developers-42/locations/u...clusters/terraform-lcp-cluster-for-mew, 20s elapsed]
google_edgecontainer_cluster.lcp-cluster: Modifications complete after 23s [id=projects/gmec-developers-42/locations/us-central1/clusters/terraform-lcp-cluster-for-mew]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
```

# confirm cluster's exclusion windows are applied properly via gcloud command
```
maintenancePolicy:
  maintenanceExclusions:
  - id: short-exclusion
    window:
      endTime: '2024-06-01T12:00:00Z'
      startTime: '2024-06-01T00:00:00Z'
  - id: long-exclusion
    window:
      endTime: '2024-06-10T00:00:00Z'
      startTime: '2024-06-03T00:00:00Z'
  window:
    recurringWindow:
      recurrence: FREQ=WEEKLY
      window:
        endTime: '2024-05-27T06:00:00Z'
        startTime: '2024-05-27T00:00:00Z'
updateTime: '2024-05-28T20:46:35.907665236Z'
```

# Test modifying the exclusion windows (remove the one of the exclusion windows)
```
jamesjungis@jamesjungis:~/terraform-test-dir$ TF_CLI_CONFIG_FILE="/usr/local/google/home/jamesjungis/tf-dev-override.tfrc" terraform plan
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - hashicorp/google in /usr/local/google/home/jamesjungis/go/bin
│  - hashicorp/google-beta in /usr/local/google/home/jamesjungis/go/bin
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible
│ with published releases.
╵
google_edgecontainer_cluster.lcp-cluster: Refreshing state... [id=projects/gmec-developers-42/locations/us-central1/clusters/terraform-lcp-cluster-for-mew]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # google_edgecontainer_cluster.lcp-cluster will be updated in-place
  ~ resource "google_edgecontainer_cluster" "lcp-cluster" {
        id                                        = "projects/gmec-developers-42/locations/us-central1/clusters/terraform-lcp-cluster-for-mew"
        name                                      = "terraform-lcp-cluster-for-mew"
        # (17 unchanged attributes hidden)

      ~ maintenance_policy {
          + maintenance_exclusions {
              + id = "long-exclusion"

              + window {
                  + end_time   = "2024-06-10T08:00:00Z"
                  + start_time = "2024-06-03T00:00:00Z"
                }
            }

            # (1 unchanged block hidden)
        }

        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform
apply" now.
jamesjungis@jamesjungis:~/terraform-test-dir$ TF_CLI_CONFIG_FILE="/usr/local/google/home/jamesjungis/tf-dev-override.tfrc" terraform apply
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - hashicorp/google in /usr/local/google/home/jamesjungis/go/bin
│  - hashicorp/google-beta in /usr/local/google/home/jamesjungis/go/bin
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible
│ with published releases.
╵
google_edgecontainer_cluster.lcp-cluster: Refreshing state... [id=projects/gmec-developers-42/locations/us-central1/clusters/terraform-lcp-cluster-for-mew]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # google_edgecontainer_cluster.lcp-cluster will be updated in-place
  ~ resource "google_edgecontainer_cluster" "lcp-cluster" {
        id                                        = "projects/gmec-developers-42/locations/us-central1/clusters/terraform-lcp-cluster-for-mew"
        name                                      = "terraform-lcp-cluster-for-mew"
        # (17 unchanged attributes hidden)

      ~ maintenance_policy {
          + maintenance_exclusions {
              + id = "long-exclusion"

              + window {
                  + end_time   = "2024-06-10T08:00:00Z"
                  + start_time = "2024-06-03T00:00:00Z"
                }
            }

            # (1 unchanged block hidden)
        }

        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_edgecontainer_cluster.lcp-cluster: Modifying... [id=projects/gmec-developers-42/locations/us-central1/clusters/terraform-lcp-cluster-for-mew]
google_edgecontainer_cluster.lcp-cluster: Still modifying... [id=projects/gmec-developers-42/locations/u...clusters/terraform-lcp-cluster-for-mew, 10s elapsed]
google_edgecontainer_cluster.lcp-cluster: Still modifying... [id=projects/gmec-developers-42/locations/u...clusters/terraform-lcp-cluster-for-mew, 20s elapsed]
google_edgecontainer_cluster.lcp-cluster: Modifications complete after 23s [id=projects/gmec-developers-42/locations/us-central1/clusters/terraform-lcp-cluster-for-mew]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
```
# Check that cluster has updated the exclusion windows to have only one exclusion window left via gcloud.
```
jamesjungis@jamesjungis:/google/src/cloud/jamesjungis/tinker/google3$ edgec clusters describe terraform-lcp-cluster-for-mew --location us-central1 --project 728138836403
maintenancePolicy:
  maintenanceExclusions:
  - id: long-exclusion
    window:
      endTime: '2024-06-10T08:00:00Z'
      startTime: '2024-06-03T00:00:00Z'
  window:
    recurringWindow:
      recurrence: FREQ=WEEKLY
      window:
        endTime: '2024-05-27T06:00:00Z'
        startTime: '2024-05-27T00:00:00Z'
```